src/gSOAPgenerated/TransPC_Server.GetHardwareInfo.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:elsys-TransPC-device">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:HardwareInfo>
   <device>
    <deviceID>0</deviceID>
    <serverSoftwareVersion>0</serverSoftwareVersion>
    <simulatedHardware>false</simulatedHardware>
    <deviceName></deviceName>
    <DeviceDescription></DeviceDescription>
    <UseLocalTime>false</UseLocalTime>
    <AutoStartMeasurement>false</AutoStartMeasurement>
    <AutoStartAutosequence>false</AutoStartAutosequence>
    <ServerPort>0</ServerPort>
    <ServerPortTwoinOne>0</ServerPortTwoinOne>
    <TargetPort>0</TargetPort>
    <TwoInOne>false</TwoInOne>
    <TwoInOnepassword></TwoInOnepassword>
    <DataFileName></DataFileName>
    <NumberOfBackupFiles>0</NumberOfBackupFiles>
    <HdFlushInterval>0</HdFlushInterval>
    <WriteTroughCache>false</WriteTroughCache>
    <ModelType>0</ModelType>
    <SyncLinkDetected>0</SyncLinkDetected>
   </device>
   <boards>
    <item>
     <boardAddress>0</boardAddress>
     <info>
      <boardClass>0</boardClass>
      <hardwareVersion>0</hardwareVersion>
      <serialNr>0</serialNr>
      <driverVersion>0</driverVersion>
      <firmwareVersion>0</firmwareVersion>
      <numberOfInputs>0</numberOfInputs>
      <maxMemory>0</maxMemory>
      <maxSpeed>0</maxSpeed>
      <operationModeOptions>0</operationModeOptions>
      <averageOptions>0</averageOptions>
      <triggerOptions>0</triggerOptions>
      <lastFactoryCalibration>
       <year>0</year>
       <month>0</month>
       <day>0</day>
       <hour>0</hour>
       <minute>0</minute>
       <second>0</second>
       <milliSecond>0</milliSecond>
      </lastFactoryCalibration>
      <lastUserCalibration>
       <year>0</year>
       <month>0</month>
       <day>0</day>
       <hour>0</hour>
       <minute>0</minute>
       <second>0</second>
       <milliSecond>0</milliSecond>
      </lastUserCalibration>
      <maxAdcSpeed>0</maxAdcSpeed>
      <boardClock>0</boardClock>
     </info>
    </item>
   </boards>
   <inputs>
    <item>
     <boardAddress>0</boardAddress>
     <inputNumber>0</inputNumber>
     <info>
      <inputClass>0</inputClass>
      <hardwareVersion>0</hardwareVersion>
      <maxAdcSpeed>0</maxAdcSpeed>
      <adcResolution>0</adcResolution>
      <offsetOptions>0</offsetOptions>
      <filterOptions>0</filterOptions>
      <diffOptions>0</diffOptions>
      <inputCouplingOptions>0</inputCouplingOptions>
      <inputRanges SOAP-ENC:arrayType="xsd:double[11]">
       <item>0.0</item>
       <item>0.0</item>
       <item>0.0</item>
       <item>0.0</item>
       <item>0.0</item>
       <item>0.0</item>
       <item>0.0</item>
       <item>0.0</item>
       <item>0.0</item>
       <item>0.0</item>
       <item>0.0</item>
      </inputRanges>
      <maxMarkerMask>0</maxMarkerMask>
     </info>
    </item>
   </inputs>
  </ns:HardwareInfo>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
